//Операторы сравнения( > < >= <= == != === !==) (результат всегда true или fasle)
console.log('3 > 2', 3 > 2)
console.log('3 > 5', 3 > 5)
//Оператор равенства == и не равенства !=
console.log('4 == 4', 4 == 4)
console.log('4 == 5', 4 == 5)
console.log('4 != 5', 4 != 5)
// Оператор тоже равенства === но учитывает ещё тип переменной (в js рекомендуют именно его использовать всегда)
console.log('4 === 4', 4 === 4)
console.log('4 === 5', 4 === 5)
console.log('4 === 4', 4 === '4')//false
console.log('4 == 4', 4 == '4')//true
console.log('4 !== 4', 4 !== '4')//true
