export const url = {
  //urlBack1: 'http://disp.itsuek.online/src/disp.php',
  //urlBack1: 'http://disp/src/disp.php',
  urlBack1: 'http://disp.eurochem.ru/src/disp.php',
  //urlBack1: 'https://logistics.sibgenco.ru/src/disp.php',
  urlBack2: '/src/disp.php'
}

export const arrDate = ['08:00', '08:30', '09:00', '09:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00', '13:30', '14:00', '14:30', '15:00', '15:30', '16:00', '16:30', '17:00', '17:30', '18:00', '18:30', '19:00', '19:30', '20:00', '20:30', '21:00']

export const arrPurposeTrip = ['Встреча/проводы аэропорт/вокзал гостей офиса или командированных руководителей высшего звена', 'Сопровождение в месте командирования по точкам следования', 'Поездка на станции', 'Доставка сотрудников к месту проведения переговоров или встреч вне офиса филиала', 'Перевозка денежных средств, конфиденциальной информации', 'Поручения руководителя филиала', 'Поездки для хозяйственных нужд']

export const arrCarType = ['Разъездная', 'Персональная']