<div class="contentRight">
  <h1>Инструкция</h1>
  <p>1) В левой части экрана находится меню навигации приложения. </p>
  <p>2) Для начала формирования документа нажимаем левой кнопкой мыши "Создать документ".</p>
  <p>&nbsp;&nbsp;а) Выбрать тип документа из выпадающего списка.</p>
  <p>&nbsp;&nbsp;б) Заполнить поле тема документа.</p>
  <p>&nbsp;&nbsp;в) Выбрать согласовывающих.</p>
  <p>&nbsp;&nbsp;г) Прикрепить необходимые файлы к документу и нажать кнопку "Отправить".</p>
  <p>3) Для просмотра документов отправленных мной или мне, нажать левой кнопкой мыши "Мои документы".</p>
  <p>&nbsp;&nbsp;а) После создания документа он получает статус "На согласовании", при таком статусе можно добавлять/удалять согласующих, добавлять/удалять файлы, писать комментарии. </p>
  <p>&nbsp;&nbsp;б) Если я добавлен в документ как согласующий, то появляется кнопка "Согласовать".</p>
  <p>&nbsp;&nbsp;в) После того как документ подпишут все согласующие он приобретает статус “На рассмотрении”, при этом статусе помошник руководителя может назначить ответственного исполнителя и статус документа измениться “На исполнение”, у исполнителя появится кнопка “Выполнено”.</p>
  <p>&nbsp;&nbsp;г) Помошник руководителя в любой момент может отправить документ на повторное согласование для добавления новых файлов/согласующих/комментариев. </p>
  <p>&nbsp;&nbsp;д) Помошник руководителя в любой момент может завершить движение документа нажав кнопку “Завершить документ”, при этом статус документа изменится на “Завершено”.</p>
  <p>4) Для просмотра завершенных документов используется кнопка “Завершенные”. </p>
</div>
