<?php
  // PhpMyAdmin на ходится в Openserver -> Дополнительно
  // По умолчанию логин и пароль root root
  // 
  // Для создание базы данных, переходим во вкладку "База данных" -> Вводим название и выбираем кодировку(по умолчанию стоит нормальная) -> создать
  // Далее заходим в созданную базу и создаём в ней нужное количество таблиц введя имя и количество строк (имя для безопасности можно делать с префиксом например secret_users)
  // Далее заполняем столбцы таблицы нужными нам параметрами
  // 
?>