<?php
  for($i = 0; $i < 3; $i++) echo 'Hello ';
  echo '<br />';

  for($i = 10; $i >= 0; $i -= 2) echo "$i, ";
  echo '<br />';

  for(; $i < 10;) { // можно не указывать 1 и 3 часть цикла, обязательная только вторая (условие)
    $i++;
    echo "$i";
    if($i < 10) echo ', ';
  }

  echo '<br />';

  for($i = 0, $j = 1; $i * $j < 1000; $i++, $j *= 2) echo "$i, $j <br />"; // в 1 и 3 частях цикла можно делать много команд
  
  for($i = 0; $i < 10; $i++) {
    if($i == 3) continue; // переходим к следующей итерации завершая текущую
    echo "$i <br />";
    if($i == 7) break; // завершает цикл
  }

  echo '<br />';

  $summ = 0;
  $n = 10;
  for($i = 1; $i <= $n; $i++) {
    $summ += $i;
  }
  echo $summ;
?>

<div>
  <?php for($i = 0; $i < 10; $i++) { ?>
    <a href="">Ссылка <?= ($i + 1) ?></a>
    <br />
  <?php } ?>
</div>