<?php
  // Методы создания массива

  $arr = array(2, 3, 5, -7);
  $arr = [2, 3, true, 'string'];

  echo "{$arr[1]} индекс в массиве начинается с 0 <br />";

  $arr[1] = 15; // меняем значение элемента массива

  for($i = 0; $i < count($arr); $i++) {
    echo $arr[$i].'<br />';
  }

  echo '---------------- <br />';

  // Ассациативный массив

  $arr_2 = ['name' => 'Michael', 'age' => 31];
  echo $arr_2['name'].'<br />'; // выводим значение по ключу массива

  echo '---------------- <br />';

  // Многомерные массивы

  $arr_3 = [[1, 2], [3, 4, 5]];
  echo $arr_3[0][1].'<br />'; // выводим значение 2

  // Перебор многомерного массива (через два цикла)

  for($i = 0; $i < count($arr_3); $i++) {
    for($j = 0; $j < count($arr_3[$i]); $j++) {
      echo $arr_3[$i][$j].'<br />';
    }
  }

  $staff = [
    [
      'name' => 'Michael',
      'age' => 31
    ],
    [
      'name' => 'Igor',
      'age' => 35
    ],
    [
      'name' => 'Alex',
      'age' => 125
    ]
    ];

  echo $staff[1]['age'];
?>