<?php
  // PHP_CodeSniffer это глобальное расширение которое ставится непосредственно в сам OpenServer, служит для выполнения правил написания кода на php (правильные отступы, табуляции и т.д. )
  // После установки, нужно выполнить настройку расширения
  // В консоли Openservera переходим в папку D:\tor\php\OpenServer\userdata\composer\vendor\squizlabs\php_codesniffer\bin
  // Выполняем команду для проверку нужного php файла - phpcs путь до файла.
  // В консоль выдедутся все ошибки не соблюдения правильного стиля кодинга 
?>